# 지정 중동 국가의 GDELT/CAMEO 국가 코드
middle_east_cameo = {
    "SAU": "사우디아라비아",
    "UAE": "아랍에미리트",
    "QAT": "카타르",
    "KUW": "쿠웨이트",
    "BHR": "바레인",
    "OMA": "오만",
    "YEM": "예멘",
    "SYR": "시리아",
    "LBN": "레바논",
    "JOR": "요르단",
    "ISR": "이스라엘",
    "PSE": "팔레스타인",
    "IRQ": "이라크",
    "IRN": "이란",
    "EGY": "이집트",
    "TUR": "튀르키예"
    }

'''
EventCode 의미
138     군사력 사용 위협
1381    봉쇄 위협
1382    점령 위협
1383    비정규적 폭력 사용 위협
1384    재래식 군사 공격 위협
1385    대량살상무기 공격 위협
139     최후통첩
152     군 경계태세 강화
154     군 병력 동원·증강
163     금수·보이콧·제재 부과
190     재래식 군사력 사용
191     봉쇄·이동 제한
192     영토 점령
193     소형무기·경무기를 이용한 전투
194     포병·전차를 이용한 전투
195     공중무기 사용
196     휴전 위반
204     대량살상무기 사용
2041    화학·생물학·방사능 무기 사용
2042    핵무기 폭발
'''

conflict_codes = [ "138", "1381", "1382", "1383",
                   "1384", "1385", "139", "152",
                   "154", "163", "190", "191",
                   "192", "193", "194", "195",
                   "196", "204", "2041", "2042" ]